app/controllers/contacts_controller.rb

SELECT * FROM "contacts" WHERE ("contacts"."id" = 6)
---
  def show
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("name", "created_at", "comments", "updated_at", "phone_number", "email_address") VALUES('from meitself', '2010-10-22 20:06:58', 'hi just a test', '2010-10-22 20:06:58', '123-123-1234', 'shjhsfg@fjgj.com')
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save